#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a = 20;
//	int b = -10;
//	//小端存储，低字节放在低地址，高字节放在高地址
//
//	return 0;
//}

//int main()
//{
//	char a = -1;//环境规定char为signed char
//	signed char b = -1;
//	unsigned char c = -1;
//	//-1原码10000000 00000000 00000000 00000001
//	//-1反码11111111 11111111 11111111 11111110
//	//-1补码11111111 11111111 11111111 11111111
//	//因为类型不相符，c仅存放后8个bit位
//	//c里面存放的是11111111
//	//按十进制打印时，c是无符号数前面补充0
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1 -1 255
//
//	return 0;
//}

int main()
{
	char a = -128;
	//128
	//原码：10000000 00000000 00000000 10000000
	//反码：11111111 11111111 11111111 01111111
	//补码：11111111 11111111 11111111 10000000
	// a存放的10000000，a为有符号的
	// 整型提升 11111111 11111111 11111111 10000000
	//无符号数即，没有符号位
	//a = 4,294,967,168
	printf("%u\n", a);

	return 0;
}